In [7]:
import pandas as pd

school_data_to_load = "schools_complete.csv"
student_data_to_load = "students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [12]:
schools_df = school_data_df['school_name'].value_counts()
schools_df.head()

Thomas High School       1
Huang High School        1
Cabrera High School      1
Rodriguez High School    1
Pena High School         1
Name: school_name, dtype: int64

In [19]:
num_students_df = len(school_data_complete_df['Student ID'].value_counts())
num_students_df

39170

In [10]:
total_budget_df = school_data_df['budget'].sum()
total_budget_df

24649428

In [11]:
avg_math_df = school_data_complete_df["math_score"].mean()
avg_math_df

78.98537145774827

In [145]:
avg_reading_df = school_data_complete_df["reading_score"].mean()
avg_reading_df

81.87784018381414

In [13]:
stu_math_pass_df = school_data_complete_df.loc[school_data_complete_df["math_score"] >= 70]
stu_math_pass_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [20]:
math_pass_percent_df = 100 * (len(stu_math_pass_df) / num_students_df)
math_pass_percent_df

74.9808526933878

In [21]:
stu_reading_pass_df = school_data_complete_df.loc[school_data_complete_df["reading_score"] >= 70]
stu_reading_pass_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [22]:
reading_pass_percent_df = 100 * (len(stu_reading_pass_df) / num_students_df)
reading_pass_percent_df

85.80546336482001

In [23]:
overall_pass_rate_df = (math_pass_percent_df + reading_pass_percent_df)/2
overall_pass_rate_df

80.39315802910392

In [27]:
district_summary = pd.DataFrame({
    "Number of School": schools_df,
    "Number of Students": num_students_df,
    "Total Budget": total_budget_df,
    "Average Math Score": avg_math_df,
    "Percent of Students Passing Math": math_pass_percent_df,
    "Percent of Students Passing Reading": reading_pass_percent_df,
    "Overall Pass Rate": overall_pass_rate_df
})
district_summary.head()

,Number of School,Number of Students,Total Budget,Average Math Score,Percent of Students Passing Math,Percent of Students Passing Reading,Overall Pass Rate
Thomas High School,1,39170,24649428,78.985371,74.980853,85.805463,80.393158
Huang High School,1,39170,24649428,78.985371,74.980853,85.805463,80.393158
Cabrera High School,1,39170,24649428,78.985371,74.980853,85.805463,80.393158
Rodriguez High School,1,39170,24649428,78.985371,74.980853,85.805463,80.393158
Pena High School,1,39170,24649428,78.985371,74.980853,85.805463,80.393158

In [28]:
school_name_df = school_data_complete_df.set_index(["school_name"])
school_name_df

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Huang High School,0,Paul Bradley,M,9th,66,79,0,District,2917,1910635
Huang High School,1,Victor Smith,M,12th,94,61,0,District,2917,1910635
Huang High School,2,Kevin Rodriguez,M,12th,90,60,0,District,2917,1910635
Huang High School,3,Dr. Richard Scott,M,12th,67,58,0,District,2917,1910635
Huang High School,4,Bonnie Ray,F,9th,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...
Thomas High School,39165,Donna Howard,F,12th,99,90,14,Charter,1635,1043130
Thomas High School,39166,Dawn Bell,F,10th,95,70,14,Charter,1635,1043130
Thomas High School,39167,Rebecca Tanner,F,9th,73,84,14,Charter,1635,1043130
Thomas High School,39168,Desiree Kidd,F,10th,99,90,14,Charter,1635,1043130
Thomas High School,39169,Carolyn Jackson,F,11th,95,75,14,Charter,1635,1043130

In [29]:
school_type_df = school_data_complete_df.set_index("school_name")["type"]
school_type_df

school_name
Huang High School     District
Huang High School     District
Huang High School     District
Huang High School     District
Huang High School     District
                        ...
Thomas High School     Charter
Thomas High School     Charter
Thomas High School     Charter
Thomas High School     Charter
Thomas High School     Charter
Name: type, Length: 39170, dtype: object

In [30]:
school_students_df = school_data_complete_df.groupby("school_name")['Student ID'].count()
school_students_df

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: Student ID, dtype: int64

In [31]:
school_budget_df = school_data_complete_df.groupby("school_name")['budget'].mean()
school_budget_df

school_name
Bailey High School       3124928
Cabrera High School      1081356
Figueroa High School     1884411
Ford High School         1763916
Griffin High School       917500
Hernandez High School    3022020
Holden High School        248087
Huang High School        1910635
Johnson High School      3094650
Pena High School          585858
Rodriguez High School    2547363
Shelton High School      1056600
Thomas High School       1043130
Wilson High School       1319574
Wright High School       1049400
Name: budget, dtype: int64

In [32]:
per_student_budget_df = school_budget_df/school_students_df
per_student_budget_df

school_name
Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [33]:
school_avg_math_score_df = school_data_complete_df.groupby(["school_name"])['math_score'].mean()
school_avg_math_score_df

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [34]:
school_avg_reading_score_df = school_data_complete_df.groupby(['school_name'])['reading_score'].mean()
school_avg_reading_score_df

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [35]:
sch_pass_math_df = school_data_complete_df.loc[school_data_complete_df["math_score"]>=70]
sch_pass_math_df

school_pass_math_df = sch_pass_math_df["school_name"].value_counts()
school_pass_math_df

percent_sch_pass_math_df = school_pass_math_df/num_students_df*100
percent_sch_pass_math_df

Bailey High School       8.470768
Johnson High School      8.029104
Hernandez High School    7.898902
Rodriguez High School    6.775594
Wilson High School       5.471024
Figueroa High School     4.968088
Huang High School        4.891499
Ford High School         4.776615
Cabrera High School      4.465152
Wright High School       4.288997
Shelton High School      4.220066
Thomas High School       3.893286
Griffin High School      3.500128
Pena High School         2.323207
Holden High School       1.008425
Name: school_name, dtype: float64

In [36]:
sch_pass_reading_df = school_data_complete_df.loc[school_data_complete_df["reading_score"]>=70]
sch_pass_reading_df

school_pass_reading_df = sch_pass_reading_df["school_name"].value_counts()
school_pass_reading_df

percent_sch_pass_reading_df = school_pass_reading_df/num_students_df*100
percent_sch_pass_reading_df

Bailey High School       10.408476
Johnson High School       9.872351
Hernandez High School     9.568547
Rodriguez High School     8.189941
Figueroa High School      6.078632
Huang High School         6.055655
Wilson High School        5.626755
Ford High School          5.545060
Cabrera High School       4.603013
Wright High School        4.439622
Shelton High School       4.309420
Thomas High School        4.061782
Griffin High School       3.640541
Pena High School          2.356395
Holden High School        1.049272
Name: school_name, dtype: float64

In [37]:
school_overall_pass_rate_df = percent_sch_pass_math_df+percent_sch_pass_reading_df/num_students_df
school_overall_pass_rate_df

Bailey High School       8.471034
Cabrera High School      4.465269
Figueroa High School     4.968243
Ford High School         4.776756
Griffin High School      3.500221
Hernandez High School    7.899147
Holden High School       1.008452
Huang High School        4.891653
Johnson High School      8.029356
Pena High School         2.323267
Rodriguez High School    6.775803
Shelton High School      4.220176
Thomas High School       3.893389
Wilson High School       5.471167
Wright High School       4.289110
Name: school_name, dtype: float64

In [80]:
school_type_df = school_type_df.reset_index(drop=True)
school_students_df = school_students_df.reset_index(drop=True)
school_budget_df = school_budget_df.reset_index(drop=True)
per_student_budget_df = per_student_budget_df.reset_index(drop=True)
school_avg_math_score_df = school_avg_math_score_df.reset_index(drop=True)
school_avg_reading_score_df = school_avg_reading_score_df.reset_index(drop=True)
percent_sch_pass_math_df = percent_sch_pass_math_df.reset_index(drop=True)
percent_sch_pass_reading_df = percent_sch_pass_reading_df.reset_index(drop=True)
school_overall_pass_rate_df = school_overall_pass_rate_df.reset_index(drop=True)

school_summary_df = pd.DataFrame({"School Type":school_type_df, 
                                  "Total Students":school_students_df, 
                                  "Total School Budget":school_budget_df,
                                  "Per Student Budget":per_student_budget_df,
                                  "Average Math Score":school_avg_math_score_df,
                                  "Average Reading Score":school_avg_reading_score_df,
                                  "% Passing Math":percent_sch_pass_math_df, 
                                  "% Passing Reading":percent_sch_pass_reading_df,
                                  "% Overall Passing Rate":school_overall_pass_rate_df})
school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,District,4976.0,3124928.0,628.0,77.048432,81.033963,8.470768,10.408476,8.471034
1,District,1858.0,1081356.0,582.0,83.061895,83.975780,8.029104,9.872351,4.465269
2,District,2949.0,1884411.0,639.0,76.711767,81.158020,7.898902,9.568547,4.968243
3,District,2739.0,1763916.0,644.0,77.102592,80.746258,6.775594,8.189941,4.776756
4,District,1468.0,917500.0,625.0,83.351499,83.816757,5.471024,6.078632,3.500221

In [62]:
top_perform_school_df = school_summary_df.sort_values(["% Overall Passing Rate" ], 
                                        ascending=False)
top_perform_school_df

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,District,4976.0,3124928.0,628.0,77.048432,81.033963,8.470768,10.408476,8.471034
8,District,4761.0,3094650.0,650.0,77.072464,80.966394,4.465152,4.603013,8.029356
5,District,4635.0,3022020.0,652.0,77.289752,80.934412,4.968088,6.055655,7.899147
10,District,3999.0,2547363.0,637.0,76.842711,80.744686,4.220066,4.309420,6.775803
13,District,2283.0,1319574.0,578.0,83.274201,83.989488,2.323207,2.356395,5.471167
...,...,...,...,...,...,...,...,...,...
39165,Charter,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39166,Charter,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39167,Charter,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39168,Charter,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39169,Charter,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [63]:
bottom_perform_school_df = school_summary_df.sort_values(["% Overall Passing Rate" ], 
                                        decending=False)
bottom_perform_school_df

TypeError: sort_values() got an unexpected keyword argument 'decending'

In [64]:
math_9th_df=student_data_df.loc[student_data_df["grade"] == "9th"].groupby(["school_name"])['math_score'].mean()
math_9th_df

school_name
Bailey High School       77.083676
Cabrera High School      83.094697
Figueroa High School     76.403037
Ford High School         77.361345
Griffin High School      82.044010
Hernandez High School    77.438495
Holden High School       83.787402
Huang High School        77.027251
Johnson High School      77.187857
Pena High School         83.625455
Rodriguez High School    76.859966
Shelton High School      83.420755
Thomas High School       83.590022
Wilson High School       83.085578
Wright High School       83.264706
Name: math_score, dtype: float64

In [65]:
math_10th_df=student_data_df.loc[student_data_df["grade"] == "10th"].groupby(["school_name"])['math_score'].mean()
math_10th_df

school_name
Bailey High School       76.996772
Cabrera High School      83.154506
Figueroa High School     76.539974
Ford High School         77.672316
Griffin High School      84.229064
Hernandez High School    77.337408
Holden High School       83.429825
Huang High School        75.908735
Johnson High School      76.691117
Pena High School         83.372000
Rodriguez High School    76.612500
Shelton High School      82.917411
Thomas High School       83.087886
Wilson High School       83.724422
Wright High School       84.010288
Name: math_score, dtype: float64

In [66]:
math_11th_df=student_data_df.loc[student_data_df["grade"] == "11th"].groupby(["school_name"])['math_score'].mean()
math_11th_df

school_name
Bailey High School       77.515588
Cabrera High School      82.765560
Figueroa High School     76.884344
Ford High School         76.918058
Griffin High School      83.842105
Hernandez High School    77.136029
Holden High School       85.000000
Huang High School        76.446602
Johnson High School      77.491653
Pena High School         84.328125
Rodriguez High School    76.395626
Shelton High School      83.383495
Thomas High School       83.498795
Wilson High School       83.195326
Wright High School       83.836782
Name: math_score, dtype: float64

In [67]:
math_12th_df=student_data_df.loc[student_data_df["grade"] == "12th"].groupby(["school_name"])['math_score'].mean()
math_12th_df

school_name
Bailey High School       76.492218
Cabrera High School      83.277487
Figueroa High School     77.151369
Ford High School         76.179963
Griffin High School      83.356164
Hernandez High School    77.186567
Holden High School       82.855422
Huang High School        77.225641
Johnson High School      76.863248
Pena High School         84.121547
Rodriguez High School    77.690748
Shelton High School      83.778976
Thomas High School       83.497041
Wilson High School       83.035794
Wright High School       83.644986
Name: math_score, dtype: float64

In [68]:
grade_math_df=pd.DataFrame({"9th":math_9th_df, 
                            "10th": math_10th_df, 
                            "11th":math_11th_df, 
                            "12th":math_12th_df 
                           })
grade_math_df

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [69]:
reading_9th_df=student_data_df.loc[student_data_df["grade"] == "9th"].groupby(["school_name"])['reading_score'].mean()
reading_9th_df

school_name
Bailey High School       81.303155
Cabrera High School      83.676136
Figueroa High School     81.198598
Ford High School         80.632653
Griffin High School      83.369193
Hernandez High School    80.866860
Holden High School       83.677165
Huang High School        81.290284
Johnson High School      81.260714
Pena High School         83.807273
Rodriguez High School    80.993127
Shelton High School      84.122642
Thomas High School       83.728850
Wilson High School       83.939778
Wright High School       83.833333
Name: reading_score, dtype: float64

In [70]:
reading_10th_df=student_data_df.loc[student_data_df["grade"] == "10th"].groupby(["school_name"])['reading_score'].mean()
reading_10th_df

school_name
Bailey High School       80.907183
Cabrera High School      84.253219
Figueroa High School     81.408912
Ford High School         81.262712
Griffin High School      83.706897
Hernandez High School    80.660147
Holden High School       83.324561
Huang High School        81.512386
Johnson High School      80.773431
Pena High School         83.612000
Rodriguez High School    80.629808
Shelton High School      83.441964
Thomas High School       84.254157
Wilson High School       84.021452
Wright High School       83.812757
Name: reading_score, dtype: float64

In [71]:
reading_11th_df=student_data_df.loc[student_data_df["grade"] == "11th"].groupby(["school_name"])['reading_score'].mean()
reading_11th_df

school_name
Bailey High School       80.945643
Cabrera High School      83.788382
Figueroa High School     80.640339
Ford High School         80.403642
Griffin High School      84.288089
Hernandez High School    81.396140
Holden High School       83.815534
Huang High School        81.417476
Johnson High School      80.616027
Pena High School         84.335938
Rodriguez High School    80.864811
Shelton High School      84.373786
Thomas High School       83.585542
Wilson High School       83.764608
Wright High School       84.156322
Name: reading_score, dtype: float64

In [72]:
reading_12th_df=student_data_df.loc[student_data_df["grade"] == "12th"].groupby(["school_name"])['reading_score'].mean()
reading_12th_df

school_name
Bailey High School       80.912451
Cabrera High School      84.287958
Figueroa High School     81.384863
Ford High School         80.662338
Griffin High School      84.013699
Hernandez High School    80.857143
Holden High School       84.698795
Huang High School        80.305983
Johnson High School      81.227564
Pena High School         84.591160
Rodriguez High School    80.376426
Shelton High School      82.781671
Thomas High School       83.831361
Wilson High School       84.317673
Wright High School       84.073171
Name: reading_score, dtype: float64

In [73]:
grade_reading_df=pd.DataFrame({"9th":reading_9th_df, 
                            "10th": reading_10th_df, 
                            "11th":reading_11th_df, 
                            "12th":reading_12th_df 
                           })
grade_reading_df

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [74]:
school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,District,4976.0,3124928.0,628.0,77.048432,81.033963,8.470768,10.408476,8.471034
1,District,1858.0,1081356.0,582.0,83.061895,83.975780,8.029104,9.872351,4.465269
2,District,2949.0,1884411.0,639.0,76.711767,81.158020,7.898902,9.568547,4.968243
3,District,2739.0,1763916.0,644.0,77.102592,80.746258,6.775594,8.189941,4.776756
4,District,1468.0,917500.0,625.0,83.351499,83.816757,5.471024,6.078632,3.500221

In [85]:
spend_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$586-620", "$621-650", "$651-675"]

In [86]:
school_summary_df["Spending Ranges (Per Student)"]=pd.cut(school_summary_df["Total School Budget"]/school_summary_df["Total Students"],spend_bins, labels=group_names)

scores_by_school_df = school_summary_df.drop(columns=["Total Students", "Total School Budget","School Type", "Per Student Budget"])
scores_by_school_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate,Spending Ranges (Per Student)
0,77.048432,81.033963,8.470768,10.408476,8.471034,$621-650
1,83.061895,83.975780,8.029104,9.872351,4.465269,<$585
2,76.711767,81.158020,7.898902,9.568547,4.968243,$621-650
3,77.102592,80.746258,6.775594,8.189941,4.776756,$621-650
4,83.351499,83.816757,5.471024,6.078632,3.500221,$621-650
...,...,...,...,...,...,...
39165,NaN,NaN,NaN,NaN,NaN,NaN
39166,NaN,NaN,NaN,NaN,NaN,NaN
39167,NaN,NaN,NaN,NaN,NaN,NaN
39168,NaN,NaN,NaN,NaN,NaN,NaN
39169,NaN,NaN,NaN,NaN,NaN,NaN

In [87]:
school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate,Spending Ranges (Per Student)
0,District,4976.0,3124928.0,628.0,77.048432,81.033963,8.470768,10.408476,8.471034,$621-650
1,District,1858.0,1081356.0,582.0,83.061895,83.975780,8.029104,9.872351,4.465269,<$585
2,District,2949.0,1884411.0,639.0,76.711767,81.158020,7.898902,9.568547,4.968243,$621-650
3,District,2739.0,1763916.0,644.0,77.102592,80.746258,6.775594,8.189941,4.776756,$621-650
4,District,1468.0,917500.0,625.0,83.351499,83.816757,5.471024,6.078632,3.500221,$621-650

In [90]:
size_bins = [0, 1000, 2500, 5000]
group_names = ["Small (<1000)" , "Medium (1001-2500)" , "Large (2501-5000)"]

In [91]:
type("School Size")

str

In [104]:
school_summary_df["School Size"]=pd.cut(school_summary_df["Total Students"], size_bins, labels=group_names)

scores_by_school_size=school_summary_df .drop(columns=["Total Students","School Type",])
scores_by_school_size.head()

,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate,Spending Ranges (Per Student),School Size
0,3124928.0,628.0,77.048432,81.033963,8.470768,10.408476,8.471034,$621-650,Large (2501-5000)
1,1081356.0,582.0,83.061895,83.975780,8.029104,9.872351,4.465269,<$585,Medium (1001-2500)
2,1884411.0,639.0,76.711767,81.158020,7.898902,9.568547,4.968243,$621-650,Large (2501-5000)
3,1763916.0,644.0,77.102592,80.746258,6.775594,8.189941,4.776756,$621-650,Large (2501-5000)
4,917500.0,625.0,83.351499,83.816757,5.471024,6.078632,3.500221,$621-650,Medium (1001-2500)

In [105]:
school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate,Spending Ranges (Per Student),School Size
0,District,4976.0,3124928.0,628.0,77.048432,81.033963,8.470768,10.408476,8.471034,$621-650,Large (2501-5000)
1,District,1858.0,1081356.0,582.0,83.061895,83.975780,8.029104,9.872351,4.465269,<$585,Medium (1001-2500)
2,District,2949.0,1884411.0,639.0,76.711767,81.158020,7.898902,9.568547,4.968243,$621-650,Large (2501-5000)
3,District,2739.0,1763916.0,644.0,77.102592,80.746258,6.775594,8.189941,4.776756,$621-650,Large (2501-5000)
4,District,1468.0,917500.0,625.0,83.351499,83.816757,5.471024,6.078632,3.500221,$621-650,Medium (1001-2500)

In [106]:
scores_by_school_type = school_summary_df.drop(columns=["Total Students","Total School Budget", "Per Student Budget"])
scores_by_school_type.head()

,School Type,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate,Spending Ranges (Per Student),School Size
0,District,77.048432,81.033963,8.470768,10.408476,8.471034,$621-650,Large (2501-5000)
1,District,83.061895,83.975780,8.029104,9.872351,4.465269,<$585,Medium (1001-2500)
2,District,76.711767,81.158020,7.898902,9.568547,4.968243,$621-650,Large (2501-5000)
3,District,77.102592,80.746258,6.775594,8.189941,4.776756,$621-650,Large (2501-5000)
4,District,83.351499,83.816757,5.471024,6.078632,3.500221,$621-650,Medium (1001-2500)

In [107]:
file_txt = "The three smallest schools have the highest average per student grades"
print(file_txt)

The three smallest schools have the highest average per student grades

In [108]:
file_txt = "Hernandez High School and Huang High School have the highest per student budget"
print(file_txt)

Hernandez High School and Huang High School have the highest per student budget